OpenRTX/OpenRTX/lib/miosix-kernel/miosix/arch/common/drivers/serial_stm32.cpp
#if defined(SERIAL_2_DMA) && !defined(STM32_NO_SERIAL_2_3)

/**
 * \internal USART2 DMA tx actual implementation
 */
void __attribute__((noinline)) usart2txDmaImpl()
{
    #if defined(_ARCH_CORTEXM3_STM32) || defined (_ARCH_CORTEXM4_STM32F3) \
     || defined(_ARCH_CORTEXM4_STM32L4)
    DMA1->IFCR=DMA_IFCR_CGIF7;
    DMA1_Channel7->CCR=0; //Disable DMA
    #else //stm32f2 and f4
    DMA1->HIFCR=DMA_HIFCR_CTCIF6
              | DMA_HIFCR_CTEIF6
              | DMA_HIFCR_CDMEIF6
              | DMA_HIFCR_CFEIF6;
    #endif
    if(ports[1]) ports[1]->IRQhandleDMAtx();
}

/**
 * \internal USART2 DMA rx actual implementation
 */
void __attribute__((noinline)) usart2rxDmaImpl()
{
    if(ports[1]) ports[1]->IRQhandleDMArx();
}

#if defined(_ARCH_CORTEXM3_STM32) || defined (_ARCH_CORTEXM4_STM32F3) \
 || defined(_ARCH_CORTEXM4_STM32L4)
/**
 * \internal DMA1 Channel 7 IRQ (configured as USART2 TX)
 */
void __attribute__((naked)) DMA1_Channel7_IRQHandler()
{
    saveContext();
    asm volatile("bl _Z15usart2txDmaImplv");
    restoreContext();
}

/**
 * \internal DMA1 Channel 6 IRQ (configured as USART2 RX)
 */
void __attribute__((naked)) DMA1_Channel6_IRQHandler()
{
    saveContext();
    asm volatile("bl _Z15usart2rxDmaImplv");
    restoreContext();
}

#else //stm32f2 and stm32f4

/**
 * \internal DMA1 stream 6 IRQ (configured as USART2 TX)
 */
void __attribute__((naked)) DMA1_Stream6_IRQHandler()
{
    saveContext();
    asm volatile("bl _Z15usart2txDmaImplv");
    restoreContext();
}

/**
 * \internal DMA1 stream 5 IRQ (configured as USART2 RX)
 */
void __attribute__((naked)) DMA1_Stream5_IRQHandler()
{
    saveContext();
    asm volatile("bl _Z15usart2rxDmaImplv");
    restoreContext();
}
#endif
#endif //SERIAL_2_DMA

#if defined(SERIAL_3_DMA) && !defined(STM32_NO_SERIAL_2_3)

/**
 * \internal USART3 DMA tx actual implementation
 */
void __attribute__((noinline)) usart3txDmaImpl()
{
    #if defined(_ARCH_CORTEXM3_STM32) || defined (_ARCH_CORTEXM4_STM32F3) \
     || defined(_ARCH_CORTEXM4_STM32L4)
    DMA1->IFCR=DMA_IFCR_CGIF2;
    DMA1_Channel2->CCR=0; //Disable DMA
    #else //stm32f2 and f4
    DMA1->LIFCR=DMA_LIFCR_CTCIF3
              | DMA_LIFCR_CTEIF3
              | DMA_LIFCR_CDMEIF3
              | DMA_LIFCR_CFEIF3;
    #endif
    if(ports[2]) ports[2]->IRQhandleDMAtx();
}

/**
 * \internal USART3 DMA rx actual implementation
 */
void __attribute__((noinline)) usart3rxDmaImpl()
{
    if(ports[2]) ports[2]->IRQhandleDMArx();
}

#if defined(_ARCH_CORTEXM3_STM32) || defined (_ARCH_CORTEXM4_STM32F3) \
 || defined(_ARCH_CORTEXM4_STM32L4)
/**
 * \internal DMA1 Channel 2 IRQ (configured as USART3 TX)
 */
void __attribute__((naked)) DMA1_Channel2_IRQHandler()
{
    saveContext();
    asm volatile("bl _Z15usart3txDmaImplv");
    restoreContext();
}

/**
 * \internal DMA1 Channel 3 IRQ (configured as USART3 RX)
 */
void __attribute__((naked)) DMA1_Channel3_IRQHandler()
{
    saveContext();
    asm volatile("bl _Z15usart3rxDmaImplv");
    restoreContext();
}

#else //stm32f2 and stm32f4

/**
 * \internal DMA1 stream 3 IRQ (configured as USART3 TX)
 */
void __attribute__((naked)) DMA1_Stream3_IRQHandler()
{
    saveContext();
    asm volatile("bl _Z15usart3txDmaImplv");
    restoreContext();
}

/**
 * \internal DMA1 stream 1 IRQ (configured as USART3 RX)
 */
void __attribute__((naked)) DMA1_Stream1_IRQHandler()
{
    saveContext();
    asm volatile("bl _Z15usart3rxDmaImplv");
    restoreContext();
}
#endif
#endif //SERIAL_3_DMA

namespace miosix {

#ifdef SERIAL_DMA
#if defined(_ARCH_CORTEXM4_STM32F4) || defined(_ARCH_CORTEXM4_STM32F3) \
 || defined(_ARCH_CORTEXM4_STM32L4)
/**
 * The STM3F3, STM32F4 and STM32L4 have an ugly quirk of having 64KB RAM area
 * called CCM that can only be accessed by the processor and not be the DMA.
 * \param x pointer to check
 * \return true if the pointer is inside the CCM, and thus it isn't possible
 * to use it for DMA transfers
 */
static bool isInCCMarea(const void *x)
{
    unsigned int ptr=reinterpret_cast<const unsigned int>(x);
    return (ptr>=0x10000000) && (ptr<(0x10000000+64*1024));
}
#else //_ARCH_CORTEXM4_STM32F4 and _ARCH_CORTEXM4_STM32F3
static inline bool isInCCMarea(const void *x) { return false; }
#endif // _ARCH_CORTEXM4_STM32F4 and _ARCH_CORTEXM4_STM32F3
#endif //SERIAL_DMA

//
// class STM32Serial
//

// A note on the baudrate/500: the buffer is selected so as to withstand
// 20ms of full data rate. In the 8N1 format one char is made of 10 bits.
// So (baudrate/10)*0.02=baudrate/500
STM32Serial::STM32Serial(int id, int baudrate, FlowCtrl flowControl)
        : Device(Device::TTY), rxQueue(rxQueueMin+baudrate/500),
          flowControl(flowControl==RTSCTS), portId(id)
{
    #if !defined(_ARCH_CORTEXM3_STM32)
    //stm32f2, f4, l4, l1, f7, h7 require alternate function mapping
    //stm32f0 family has different alternate function mapping
    //with respect to the other families
    switch(id)
    {
        case 1:
            #if !defined(_ARCH_CORTEXM0_STM32)
            u1tx::alternateFunction(7);
            u1rx::alternateFunction(7);
            if(flowControl)
            {
                u1rts::alternateFunction(7);
                u1cts::alternateFunction(7);
            }
            #else  //!defined(_ARCH_CORTEXM0_STM32)
            u1tx::alternateFunction(1);
            u1rx::alternateFunction(1);
            if(flowControl)
            {
                u1rts::alternateFunction(1);
                u1cts::alternateFunction(1);
            }
            #endif //!defined(_ARCH_CORTEXM0_STM32)
            break;
        case 2:
            #if !defined(_ARCH_CORTEXM0_STM32)
            u2tx::alternateFunction(7);
            u2rx::alternateFunction(7);
            if(flowControl)
            {
                u2rts::alternateFunction(7);
                u2cts::alternateFunction(7);
            }
            #else  //!defined(_ARCH_CORTEXM0_STM32)
            u2tx::alternateFunction(1);
            u2rx::alternateFunction(1);
            if(flowControl)
            {
                u2rts::alternateFunction(1);
                u2cts::alternateFunction(1);
            }
            #endif //!defined(_ARCH_CORTEXM0_STM32)            
            break;
        case 3:
            #if !defined(_ARCH_CORTEXM0_STM32)
            u3tx::alternateFunction(7);
            u3rx::alternateFunction(7);
            if(flowControl)
            {
                u3rts::alternateFunction(7);
                u3cts::alternateFunction(7);
            }
            #else  //!defined(_ARCH_CORTEXM0_STM32)
            u3tx::alternateFunction(4);
            u3rx::alternateFunction(4);
            if(flowControl)
            {
                u3rts::alternateFunction(4);
                u3cts::alternateFunction(4);
            }
            #endif //!defined(_ARCH_CORTEXM0_STM32)            
            break;
    }
    #endif //_ARCH_CORTEXM3_STM32
    
