OpenRTX/OpenRTX/lib/miosix-kernel/miosix/arch/common/drivers/serial_stm32.cpp
    switch(id)
    {
        case 1:
            commonInit(id,baudrate,u1tx::getPin(),u1rx::getPin(),
                       u1rts::getPin(),u1cts::getPin());
            break;
        case 2:
            commonInit(id,baudrate,u2tx::getPin(),u2rx::getPin(),
                       u2rts::getPin(),u2cts::getPin());
            break;
        case 3:
            commonInit(id,baudrate,u3tx::getPin(),u3rx::getPin(),
                       u3rts::getPin(),u3cts::getPin());
            break;
    }
}

STM32Serial::STM32Serial(int id, int baudrate, GpioPin tx, GpioPin rx)
    : Device(Device::TTY), rxQueue(rxQueueMin+baudrate/500),
      flowControl(false), portId(id)
{
    commonInit(id,baudrate,tx,rx,tx,rx); //The last two args will be ignored
}

STM32Serial::STM32Serial(int id, int baudrate, GpioPin tx, GpioPin rx,
    miosix::GpioPin rts, miosix::GpioPin cts)
    : Device(Device::TTY), rxQueue(rxQueueMin+baudrate/500),
      flowControl(true), portId(id)
{
    commonInit(id,baudrate,tx,rx,rts,cts);
}

void STM32Serial::commonInit(int id, int baudrate, GpioPin tx, GpioPin rx,
                             GpioPin rts, GpioPin cts)
{
    #ifdef SERIAL_DMA
    dmaTx=0;
    dmaRx=0;
    txWaiting=0;
    dmaTxInProgress=false;
    #endif //SERIAL_DMA
    InterruptDisableLock dLock;
    if(id<1|| id>numPorts || ports[id-1]!=0) errorHandler(UNEXPECTED);
    ports[id-1]=this;
    unsigned int freq=SystemCoreClock;
    //Quirk the position of the PPRE1 and PPRE2 bitfields in RCC->CFGR changes
    //STM32F0 does not have ppre1 and ppre2, in this case the variables are not
    //defined in order to avoid "unused variable" warning
    #if defined(_ARCH_CORTEXM3_STM32)   || defined(_ARCH_CORTEXM3_STM32L1) \
     || defined(_ARCH_CORTEXM4_STM32F3) || defined(_ARCH_CORTEXM4_STM32L4)
    const unsigned int ppre1=8;
    const unsigned int ppre2=11;
    #elif !defined(_ARCH_CORTEXM7_STM32H7) && !defined(_ARCH_CORTEXM0_STM32)
    const unsigned int ppre1=10;
    const unsigned int ppre2=13;
    #endif
    switch(id)
    {
        case 1:
            port=USART1;
            RCC->APB2ENR |= RCC_APB2ENR_USART1EN;
            RCC_SYNC();
            #ifdef SERIAL_1_DMA
            #if defined(_ARCH_CORTEXM3_STM32) || defined(_ARCH_CORTEXM4_STM32F3) \
             || defined(_ARCH_CORTEXM4_STM32L4)
            #ifdef _ARCH_CORTEXM4_STM32L4
            RCC->AHB1ENR |= RCC_AHBENR_DMA1EN;
            DMA1_CSELR->CSELR  |= (2 << DMA_CSELR_C4S_Pos) // Assign DMA1_CH4 to USART1_TX
                               |  (2 << DMA_CSELR_C5S_Pos);// Assign DMA1_CH5 to USART1_RX
            #else 
            RCC->AHBENR |= RCC_AHBENR_DMA1EN;
            #endif
            RCC_SYNC();
            NVIC_SetPriority(DMA1_Channel4_IRQn,15);//Lowest priority for serial
            NVIC_EnableIRQ(DMA1_Channel4_IRQn);
            dmaTx=DMA1_Channel4;
            //Higher priority to ensure IRQhandleDMArx() is called before
            //IRQhandleInterrupt(), so that idle is set correctly
            NVIC_SetPriority(DMA1_Channel5_IRQn,14);
            NVIC_EnableIRQ(DMA1_Channel5_IRQn);
            dmaRx=DMA1_Channel5;
            #else //stm32f2, stm32f4
            RCC->AHB1ENR |= RCC_AHB1ENR_DMA2EN;
            RCC_SYNC();
            NVIC_SetPriority(DMA2_Stream7_IRQn,15);//Lowest priority for serial
            NVIC_EnableIRQ(DMA2_Stream7_IRQn);
            dmaTx=DMA2_Stream7;
            //Higher priority to ensure IRQhandleDMArx() is called before
            //IRQhandleInterrupt(), so that idle is set correctly
            NVIC_SetPriority(DMA2_Stream5_IRQn,14);
            NVIC_EnableIRQ(DMA2_Stream5_IRQn);
            dmaRx=DMA2_Stream5;
            #endif
            port->CR3=USART_CR3_DMAT | USART_CR3_DMAR;
            #endif //SERIAL_1_DMA
            NVIC_SetPriority(USART1_IRQn,15);//Lowest priority for serial
            NVIC_EnableIRQ(USART1_IRQn);
            #if !defined(_ARCH_CORTEXM7_STM32H7) && !defined(_ARCH_CORTEXM0_STM32)
            if(RCC->CFGR & RCC_CFGR_PPRE2_2) freq/=1<<(((RCC->CFGR>>ppre2) & 0x3)+1);
            #elif defined(_ARCH_CORTEXM0_STM32)
            // STM32F0 family has only PPRE2 register
            if(RCC->CFGR & RCC_CFGR_PPRE_2) freq/=1<<(((RCC->CFGR>>8) & 0x3)+1);
            #else
            //rcc_hclk3 = SystemCoreClock / HPRE
            //rcc_pclk2 = rcc_hclk1 / D2PPRE2
            //NOTE: are rcc_hclk3 and rcc_hclk1 the same signal?
            //usart1 clock is rcc_pclk2
            if(RCC->D1CFGR & RCC_D1CFGR_HPRE_3)
                freq/=1<<(((RCC->D1CFGR>>RCC_D1CFGR_HPRE_Pos) & 0x7)+1);
            if(RCC->D2CFGR & RCC_D2CFGR_D2PPRE2_2)
                freq/=1<<(((RCC->D2CFGR>>RCC_D2CFGR_D2PPRE2_Pos) & 0x3)+1);
            #endif //_ARCH_CORTEXM7_STM32H7
            break;
        
        #if !defined(STM32_NO_SERIAL_2_3)
        case 2:
            port=USART2;
            #ifndef _ARCH_CORTEXM7_STM32H7
            #ifndef _ARCH_CORTEXM4_STM32L4
            RCC->APB1ENR |= RCC_APB1ENR_USART2EN;
            #else  //_ARCH_CORTEXM4_STM32L4
            RCC->APB1ENR1 |= RCC_APB1ENR1_USART2EN;
            #endif //_ARCH_CORTEXM4_STM32L4
            #else  //_ARCH_CORTEXM7_STM32H7
            RCC->APB1LENR |= RCC_APB1LENR_USART2EN;
            #endif //_ARCH_CORTEXM7_STM32H7
            RCC_SYNC();
            #ifdef SERIAL_2_DMA
            #if defined(_ARCH_CORTEXM3_STM32) || defined(_ARCH_CORTEXM4_STM32F3) \
             || defined(_ARCH_CORTEXM4_STM32L4)
            #ifdef _ARCH_CORTEXM4_STM32L4
            RCC->AHB1ENR |= RCC_AHB1ENR_DMA1EN;
            DMA1_CSELR->CSELR  |= (2 << DMA_CSELR_C7S_Pos) // Assign DMA1_CH7 to USART2_TX
                               |  (2 << DMA_CSELR_C6S_Pos);// Assign DMA1_CH6 to USART2_RX
            #else 
            RCC->AHBENR |= RCC_AHBENR_DMA1EN;
            #endif
            RCC_SYNC();
            NVIC_SetPriority(DMA1_Channel7_IRQn,15);//Lowest priority for serial
            NVIC_EnableIRQ(DMA1_Channel7_IRQn);
            dmaTx=DMA1_Channel7;
            //Higher priority to ensure IRQhandleDMArx() is called before
            //IRQhandleInterrupt(), so that idle is set correctly
            NVIC_SetPriority(DMA1_Channel6_IRQn,14);
            NVIC_EnableIRQ(DMA1_Channel6_IRQn);
            dmaRx=DMA1_Channel6;
            #else //stm32f2, stm32f4
            RCC->AHB1ENR |= RCC_AHB1ENR_DMA1EN;
            RCC_SYNC();
            NVIC_SetPriority(DMA1_Stream6_IRQn,15);//Lowest priority for serial
            NVIC_EnableIRQ(DMA1_Stream6_IRQn);
            dmaTx=DMA1_Stream6;
            //Higher priority to ensure IRQhandleDMArx() is called before
            //IRQhandleInterrupt(), so that idle is set correctly
            NVIC_SetPriority(DMA1_Stream5_IRQn,14);
            NVIC_EnableIRQ(DMA1_Stream5_IRQn);
            dmaRx=DMA1_Stream5;
            #endif
            port->CR3=USART_CR3_DMAT | USART_CR3_DMAR;
            #endif //SERIAL_2_DMA
            NVIC_SetPriority(USART2_IRQn,15);//Lowest priority for serial
            NVIC_EnableIRQ(USART2_IRQn);
            #if !defined(_ARCH_CORTEXM7_STM32H7) && !defined(_ARCH_CORTEXM0_STM32)
            if(RCC->CFGR & RCC_CFGR_PPRE1_2) freq/=1<<(((RCC->CFGR>>ppre1) & 0x3)+1);
            #elif defined(_ARCH_CORTEXM0_STM32)
            // STM32F0 family has only PPRE2 register
            if(RCC->CFGR & RCC_CFGR_PPRE_2) freq/=1<<(((RCC->CFGR>>8) & 0x3)+1);
            #else //_ARCH_CORTEXM7_STM32H7
            //rcc_hclk3 = SystemCoreClock / HPRE
            //rcc_pclk1 = rcc_hclk1 / D2PPRE1
            //NOTE: are rcc_hclk3 and rcc_hclk1 the same signal?
            //usart2 clock is rcc_pclk1
            if(RCC->D1CFGR & RCC_D1CFGR_HPRE_3)
                freq/=1<<(((RCC->D1CFGR>>RCC_D1CFGR_HPRE_Pos) & 0x7)+1);
            if(RCC->D2CFGR & RCC_D2CFGR_D2PPRE1_2)
                freq/=1<<(((RCC->D2CFGR>>RCC_D2CFGR_D2PPRE1_Pos) & 0x3)+1);
            #endif //_ARCH_CORTEXM7_STM32H7
            break;
        #if !defined(STM32F411xE) && !defined(STM32F401xE) && !defined(STM32F401xC)
        case 3:
            port=USART3;
            #ifndef _ARCH_CORTEXM7_STM32H7
            #ifndef _ARCH_CORTEXM4_STM32L4
            RCC->APB1ENR |= RCC_APB1ENR_USART3EN;
            #else  //_ARCH_CORTEXM4_STM32L4
            RCC->APB1ENR1 |= RCC_APB1ENR1_USART3EN;
            #endif //_ARCH_CORTEXM4_STM32L4
            #else
            RCC->APB1LENR |= RCC_APB1LENR_USART3EN;
            #endif //_ARCH_CORTEXM7_STM32H7
            RCC_SYNC();
            #ifdef SERIAL_3_DMA
            #if defined(_ARCH_CORTEXM3_STM32) || defined(_ARCH_CORTEXM4_STM32F3) \
             || defined(_ARCH_CORTEXM4_STM32L4)
            #ifdef _ARCH_CORTEXM4_STM32L4
            RCC->AHB1ENR |= RCC_AHB1ENR_DMA1EN;
            DMA1_CSELR->CSELR  |= (2 << DMA_CSELR_C2S_Pos) // Assign DMA1_CH2 to USART2_TX
                               |  (2 << DMA_CSELR_C3S_Pos);// Assign DMA1_CH3 to USART2_RX
            #else 
            RCC->AHBENR |= RCC_AHBENR_DMA1EN;
            #endif
            RCC_SYNC();
            NVIC_SetPriority(DMA1_Channel2_IRQn,15);//Lowest priority for serial
            NVIC_EnableIRQ(DMA1_Channel2_IRQn);
            dmaTx=DMA1_Channel2;
            //Higher priority to ensure IRQhandleDMArx() is called before
            //IRQhandleInterrupt(), so that idle is set correctly
            NVIC_SetPriority(DMA1_Channel3_IRQn,14);
            NVIC_EnableIRQ(DMA1_Channel3_IRQn);
            dmaRx=DMA1_Channel3;
            #else //stm32f2, stm32f4
            RCC->AHB1ENR |= RCC_AHB1ENR_DMA1EN;
            RCC_SYNC();
            NVIC_SetPriority(DMA1_Stream3_IRQn,15);//Lowest priority for serial
            NVIC_EnableIRQ(DMA1_Stream3_IRQn);
            dmaTx=DMA1_Stream3;
            //Higher priority to ensure IRQhandleDMArx() is called before
            //IRQhandleInterrupt(), so that idle is set correctly
            NVIC_SetPriority(DMA1_Stream1_IRQn,14);
            NVIC_EnableIRQ(DMA1_Stream1_IRQn);
            dmaRx=DMA1_Stream1;
            #endif
            port->CR3=USART_CR3_DMAT | USART_CR3_DMAR;
            #endif //SERIAL_3_DMA
            #if !defined(STM32F072xB)
            NVIC_SetPriority(USART3_IRQn,15);//Lowest priority for serial
            NVIC_EnableIRQ(USART3_IRQn);
            #else  //STM32F072xB
            NVIC_SetPriority(USART3_4_IRQn,15);
            NVIC_EnableIRQ(USART3_4_IRQn);
            #endif //STM32F072xB
            #if !defined(_ARCH_CORTEXM7_STM32H7) && !defined(_ARCH_CORTEXM0_STM32)
            if(RCC->CFGR & RCC_CFGR_PPRE1_2) freq/=1<<(((RCC->CFGR>>ppre1) & 0x3)+1);
            #elif defined(_ARCH_CORTEXM0_STM32)
            // STM32F0 family has only PPRE2 register
            if(RCC->CFGR & RCC_CFGR_PPRE_2) freq/=1<<(((RCC->CFGR>>8) & 0x3)+1);
            #else //_ARCH_CORTEXM7_STM32H7
            //rcc_hclk3 = SystemCoreClock / HPRE
            //rcc_pclk1 = rcc_hclk1 / D2PPRE1
            //NOTE: are rcc_hclk3 and rcc_hclk1 the same signal?
            //usart2 clock is rcc_pclk1
            if(RCC->D1CFGR & RCC_D1CFGR_HPRE_3)
                freq/=1<<(((RCC->D1CFGR>>RCC_D1CFGR_HPRE_Pos) & 0x7)+1);
            if(RCC->D2CFGR & RCC_D2CFGR_D2PPRE1_2)
                freq/=1<<(((RCC->D2CFGR>>RCC_D2CFGR_D2PPRE1_Pos) & 0x3)+1);
            #endif //_ARCH_CORTEXM7_STM32H7
            break;
        #endif //!defined(STM32F411xE) && !defined(STM32F401xE) && !defined(STM32F401xC)
        #endif //!defined(STM32_NO_SERIAL_2_3)
    }
    //Quirk: stm32f1 rx pin has to be in input mode, while stm32f2 and up want
    //it in ALTERNATE mode. Go figure...
    #ifdef _ARCH_CORTEXM3_STM32
    Mode::Mode_ rxPinMode=Mode::INPUT;
    #else //_ARCH_CORTEXM3_STM32
    Mode::Mode_ rxPinMode=Mode::ALTERNATE;
    #endif //_ARCH_CORTEXM3_STM32
    tx.mode(Mode::ALTERNATE);
    rx.mode(rxPinMode);
    if(flowControl)
    {
        rts.mode(Mode::ALTERNATE);
        cts.mode(rxPinMode);
    }
    const unsigned int quot=2*freq/baudrate; //2*freq for round to nearest
    port->BRR=quot/2 + (quot & 1);           //Round to nearest
    if(flowControl==false) port->CR3 |= USART_CR3_ONEBIT;
    else port->CR3 |= USART_CR3_ONEBIT | USART_CR3_RTSE | USART_CR3_CTSE;
    //Enabled, 8 data bit, no parity, interrupt on character rx
    #ifdef SERIAL_DMA
    if(dmaTx)
    {
        port->CR1 = USART_CR1_UE     //Enable port
                  | USART_CR1_IDLEIE //Interrupt on idle line
                  | USART_CR1_TE     //Transmission enbled
                  | USART_CR1_RE;    //Reception enabled
        IRQdmaReadStart();
        return;
    }
    #endif //SERIAL_DMA
    port->CR1 = USART_CR1_UE     //Enable port
              | USART_CR1_RXNEIE //Interrupt on data received
              | USART_CR1_IDLEIE //Interrupt on idle line
              | USART_CR1_TE     //Transmission enbled
              | USART_CR1_RE;    //Reception enabled
}

