OpenRTX/OpenRTX/lib/miosix-kernel/miosix/arch/common/drivers/serial_stm32.cpp
ssize_t STM32Serial::readBlock(void *buffer, size_t size, off_t where)
{
    Lock<FastMutex> l(rxMutex);
    char *buf=reinterpret_cast<char*>(buffer);
    size_t result=0;
    FastInterruptDisableLock dLock;
    for(;;)
    {
        //Try to get data from the queue
        for(;result<size;result++)
        {
            if(rxQueue.tryGet(buf[result])==false) break;
            //This is here just not to keep IRQ disabled for the whole loop
            FastInterruptEnableLock eLock(dLock);
        }
        if(idle && result>0) break;
        if(result==size) break;
        //Wait for data in the queue
        do {
            rxWaiting=Thread::IRQgetCurrentThread();
            Thread::IRQwait();
            {
                FastInterruptEnableLock eLock(dLock);
                Thread::yield();
            }
        } while(rxWaiting);
    }
    return result;
}

ssize_t STM32Serial::writeBlock(const void *buffer, size_t size, off_t where)
{
    Lock<FastMutex> l(txMutex);
    const char *buf=reinterpret_cast<const char*>(buffer);
    #ifdef SERIAL_DMA
    if(dmaTx)
    {
        size_t remaining=size;
        if(isInCCMarea(buf)==false)
        {
            //Use zero copy for all but the last txBufferSize bytes, if possible
            while(remaining>txBufferSize)
            {
                //DMA is limited to 64K
                size_t transferSize=min<size_t>(remaining-txBufferSize,65535);
                waitDmaTxCompletion();
                writeDma(buf,transferSize);
                buf+=transferSize;
                remaining-=transferSize;
            }
        }
        while(remaining>0)
        {
            size_t transferSize=min(remaining,static_cast<size_t>(txBufferSize));
            waitDmaTxCompletion();
            //Copy to txBuffer only after DMA xfer completed, as the previous
            //xfer may be using the same buffer
            memcpy(txBuffer,buf,transferSize);
            writeDma(txBuffer,transferSize);
            buf+=transferSize;
            remaining-=transferSize;
        }
        return size;
    }
    #endif //SERIAL_DMA
    for(size_t i=0;i<size;i++)
    {
        #if !defined(_ARCH_CORTEXM7_STM32F7) && !defined(_ARCH_CORTEXM7_STM32H7) \
         && !defined(_ARCH_CORTEXM0_STM32)   && !defined(_ARCH_CORTEXM4_STM32F3) \
         && !defined(_ARCH_CORTEXM4_STM32L4)
        while((port->SR & USART_SR_TXE)==0) ;
        port->DR=*buf++;
        #else //_ARCH_CORTEXM7_STM32F7/H7
        while((port->ISR & USART_ISR_TXE)==0) ;
        port->TDR=*buf++;
        #endif //_ARCH_CORTEXM7_STM32F7/H7
    }
    return size;
}

void STM32Serial::IRQwrite(const char *str)
{
    // We can reach here also with only kernel paused, so make sure
    // interrupts are disabled. This is important for the DMA case
    bool interrupts=areInterruptsEnabled();
    if(interrupts) fastDisableInterrupts();
    #ifdef SERIAL_DMA
    if(dmaTx)
    {
        #if defined(_ARCH_CORTEXM3_STM32) || defined(_ARCH_CORTEXM4_STM32F3) \
         || defined(_ARCH_CORTEXM4_STM32L4)
        //If no DMA transfer is in progress bit EN is zero. Otherwise wait until
        //DMA xfer ends, by waiting for the TC (or TE) interrupt flag
        static const unsigned int irqMask[]=
        {
            (DMA_ISR_TCIF4 | DMA_ISR_TEIF4),
            (DMA_ISR_TCIF7 | DMA_ISR_TEIF7),
            (DMA_ISR_TCIF2 | DMA_ISR_TEIF2)
        };
        #if defined(_ARCH_CORTEXM4_STM32F3) || defined(_ARCH_CORTEXM4_STM32L4)
        // Workaround for ST messing up with flag definitions...
        constexpr unsigned int DMA_CCR4_EN = DMA_CCR_EN;
        #endif
        while((dmaTx->CCR & DMA_CCR4_EN) && !(DMA1->ISR & irqMask[getId()-1])) ;
        #else //_ARCH_CORTEXM3_STM32
        //Wait until DMA xfer ends. EN bit is cleared by hardware on transfer end
        while(dmaTx->CR & DMA_SxCR_EN) ;
        #endif //_ARCH_CORTEXM3_STM32
    }
    #endif //SERIAL_DMA
    while(*str)
    {
        #if !defined(_ARCH_CORTEXM7_STM32F7) && !defined(_ARCH_CORTEXM7_STM32H7) \
         && !defined(_ARCH_CORTEXM0_STM32)   && !defined(_ARCH_CORTEXM4_STM32F3) \
         && !defined(_ARCH_CORTEXM4_STM32L4)
        while((port->SR & USART_SR_TXE)==0) ;
        port->DR=*str++;
        #else //_ARCH_CORTEXM7_STM32F7/H7
        while((port->ISR & USART_ISR_TXE)==0) ;
        port->TDR=*str++;
        #endif //_ARCH_CORTEXM7_STM32F7/H7
    }
    waitSerialTxFifoEmpty();
    if(interrupts) fastEnableInterrupts();
}

int STM32Serial::ioctl(int cmd, void* arg)
{
    if(reinterpret_cast<unsigned>(arg) & 0b11) return -EFAULT; //Unaligned
    termios *t=reinterpret_cast<termios*>(arg);
    switch(cmd)
    {
        case IOCTL_SYNC:
            waitSerialTxFifoEmpty();
            return 0;
        case IOCTL_TCGETATTR:
            t->c_iflag=IGNBRK | IGNPAR;
            t->c_oflag=0;
            t->c_cflag=CS8 | (flowControl ? CRTSCTS : 0);
            t->c_lflag=0;
            return 0;
        case IOCTL_TCSETATTR_NOW:
        case IOCTL_TCSETATTR_DRAIN:
        case IOCTL_TCSETATTR_FLUSH:
            //Changing things at runtime unsupported, so do nothing, but don't
            //return error as console_device.h implements some attribute changes
            return 0;
        default:
            return -ENOTTY; //Means the operation does not apply to this descriptor
    }
}

void STM32Serial::IRQhandleInterrupt()
{
    #if !defined(_ARCH_CORTEXM7_STM32F7) && !defined(_ARCH_CORTEXM7_STM32H7) \
     && !defined(_ARCH_CORTEXM0_STM32)   && !defined(_ARCH_CORTEXM4_STM32F3) \
     && !defined(_ARCH_CORTEXM4_STM32L4)
    unsigned int status=port->SR;
    #else //_ARCH_CORTEXM7_STM32F7/H7
    unsigned int status=port->ISR;
    constexpr unsigned int USART_SR_RXNE=USART_ISR_RXNE;
    constexpr unsigned int USART_SR_IDLE=USART_ISR_IDLE;
    constexpr unsigned int USART_SR_FE  =USART_ISR_FE;
    #endif //_ARCH_CORTEXM7_STM32F7/H7
    char c;
    #ifdef SERIAL_DMA
    if(dmaRx==0 && (status & USART_SR_RXNE))
    #else //SERIAL_DMA
    if(status & USART_SR_RXNE)
    #endif //SERIAL_DMA
    {
        //Always read data, since this clears interrupt flags
        #if !defined(_ARCH_CORTEXM7_STM32F7) && !defined(_ARCH_CORTEXM7_STM32H7) \
         && !defined(_ARCH_CORTEXM0_STM32)   && !defined(_ARCH_CORTEXM4_STM32F3) \
         && !defined(_ARCH_CORTEXM4_STM32L4)
        c=port->DR;
        #else //_ARCH_CORTEXM7_STM32F7/H7
        c=port->RDR;
        #endif //_ARCH_CORTEXM7_STM32F7/H7
        //If no error put data in buffer
        if((status & USART_SR_FE)==0)
            if(rxQueue.tryPut(c)==false) /*fifo overflow*/;
        idle=false;
    }
    if(status & USART_SR_IDLE)
    {
        #if !defined(_ARCH_CORTEXM7_STM32F7) && !defined(_ARCH_CORTEXM7_STM32H7) \
         && !defined(_ARCH_CORTEXM0_STM32)   && !defined(_ARCH_CORTEXM4_STM32F3) \
         && !defined(_ARCH_CORTEXM4_STM32L4)
        c=port->DR; //clears interrupt flags
        #else //_ARCH_CORTEXM7_STM32F7/H7
        port->ICR=USART_ICR_IDLECF; //clears interrupt flags
        #endif //_ARCH_CORTEXM7_STM32F7/H7
        #ifdef SERIAL_DMA
        if(dmaRx) IRQreadDma();
        #endif //SERIAL_DMA
        idle=true;
    }
    if((status & USART_SR_IDLE) || rxQueue.size()>=rxQueueMin)
    {
        //Enough data in buffer or idle line, awake thread
        if(rxWaiting)
        {
            rxWaiting->IRQwakeup();
            if(rxWaiting->IRQgetPriority()>
                Thread::IRQgetCurrentThread()->IRQgetPriority())
                    Scheduler::IRQfindNextThread();
            rxWaiting=0;
        }
    }
}

#ifdef SERIAL_DMA
void STM32Serial::IRQhandleDMAtx()
{
    dmaTxInProgress=false;
    if(txWaiting==0) return;
    txWaiting->IRQwakeup();
    if(txWaiting->IRQgetPriority()>Thread::IRQgetCurrentThread()->IRQgetPriority())
        Scheduler::IRQfindNextThread();
    txWaiting=0;
}

void STM32Serial::IRQhandleDMArx()
{
    IRQreadDma();
    idle=false;
    if(rxWaiting==0) return;
    rxWaiting->IRQwakeup();
    if(rxWaiting->IRQgetPriority()>Thread::IRQgetCurrentThread()->IRQgetPriority())
        Scheduler::IRQfindNextThread();
    rxWaiting=0;
}
#endif //SERIAL_DMA

STM32Serial::~STM32Serial()
{
    waitSerialTxFifoEmpty();
    {
        InterruptDisableLock dLock;
        port->CR1=0;
        int id=getId();
        ports[id-1]=0;
        switch(id)
        {
            case 1:
                #ifdef SERIAL_1_DMA
                IRQdmaReadStop();
                #if defined(_ARCH_CORTEXM3_STM32) || defined(_ARCH_CORTEXM4_STM32F3) \
                 || defined(_ARCH_CORTEXM4_STM32L4)
                NVIC_DisableIRQ(DMA1_Channel4_IRQn);
                NVIC_ClearPendingIRQ(DMA1_Channel4_IRQn);
                NVIC_DisableIRQ(DMA1_Channel5_IRQn);
                NVIC_ClearPendingIRQ(DMA1_Channel5_IRQn);
                #else //stm32f2, stm32f4
                NVIC_DisableIRQ(DMA2_Stream7_IRQn);
                NVIC_ClearPendingIRQ(DMA2_Stream7_IRQn);
                NVIC_DisableIRQ(DMA2_Stream5_IRQn);
                NVIC_ClearPendingIRQ(DMA2_Stream5_IRQn);
                #endif
                #endif //SERIAL_1_DMA
                NVIC_DisableIRQ(USART1_IRQn);
                NVIC_ClearPendingIRQ(USART1_IRQn);
                RCC->APB2ENR &= ~RCC_APB2ENR_USART1EN;
                break;
                
            #if !defined(STM32_NO_SERIAL_2_3)    
            case 2:
                #ifdef SERIAL_2_DMA
                IRQdmaReadStop();
                #if defined(_ARCH_CORTEXM3_STM32) || defined(_ARCH_CORTEXM4_STM32F3) \
                 || defined(_ARCH_CORTEXM4_STM32L4)
                NVIC_DisableIRQ(DMA1_Channel7_IRQn);
                NVIC_ClearPendingIRQ(DMA1_Channel7_IRQn);
                NVIC_DisableIRQ(DMA1_Channel6_IRQn);
                NVIC_ClearPendingIRQ(DMA1_Channel6_IRQn);
                #else //stm32f2, stm32f4
                NVIC_DisableIRQ(DMA1_Stream6_IRQn);
                NVIC_ClearPendingIRQ(DMA1_Stream6_IRQn);
                NVIC_DisableIRQ(DMA1_Stream5_IRQn);
                NVIC_ClearPendingIRQ(DMA1_Stream5_IRQn);
                #endif
                #endif //SERIAL_2_DMA
                NVIC_DisableIRQ(USART2_IRQn);
                NVIC_ClearPendingIRQ(USART2_IRQn);
                #ifndef _ARCH_CORTEXM7_STM32H7
                #ifdef _ARCH_CORTEXM4_STM32L4
                RCC->APB1ENR1 &= ~RCC_APB1ENR1_USART2EN;
                #else
                RCC->APB1ENR &= ~RCC_APB1ENR_USART2EN;
                #endif
                #else //_ARCH_CORTEXM7_STM32H7
                RCC->APB1LENR &= ~RCC_APB1LENR_USART2EN;
                #endif //_ARCH_CORTEXM7_STM32H7
                break;
            #if !defined(STM32F411xE) && !defined(STM32F401xE) && !defined(STM32F401xC)
            case 3:
                #ifdef SERIAL_3_DMA
                IRQdmaReadStop();
                #if defined(_ARCH_CORTEXM3_STM32) || defined(_ARCH_CORTEXM4_STM32F3) \
                 || defined(_ARCH_CORTEXM4_STM32L4)
                NVIC_DisableIRQ(DMA1_Channel2_IRQn);
                NVIC_ClearPendingIRQ(DMA1_Channel2_IRQn);
                NVIC_DisableIRQ(DMA1_Channel3_IRQn);
                NVIC_ClearPendingIRQ(DMA1_Channel3_IRQn);
                #else //stm32f2, stm32f4
                NVIC_DisableIRQ(DMA1_Stream3_IRQn);
                NVIC_ClearPendingIRQ(DMA1_Stream3_IRQn);
                NVIC_DisableIRQ(DMA1_Stream1_IRQn);
                NVIC_ClearPendingIRQ(DMA1_Stream1_IRQn);
                #endif
                #endif //SERIAL_3_DMA
                #if !defined(STM32F072xB)
                NVIC_SetPriority(USART3_IRQn,15);//Lowest priority for serial
                NVIC_EnableIRQ(USART3_IRQn);
                #else  //STM32F072xB
                NVIC_SetPriority(USART3_4_IRQn,15);
                NVIC_EnableIRQ(USART3_4_IRQn);
                #endif //STM32F072xB
                #ifndef _ARCH_CORTEXM7_STM32H7
                #ifdef _ARCH_CORTEXM4_STM32L4
                RCC->APB1ENR1 &= ~RCC_APB1ENR1_USART3EN;
                #else
                RCC->APB1ENR &= ~RCC_APB1ENR_USART3EN;
                #endif
                #else //_ARCH_CORTEXM7_STM32H7
                RCC->APB1LENR &= ~RCC_APB1LENR_USART3EN;
                #endif //_ARCH_CORTEXM7_STM32H7
                break;
            #endif //!defined(STM32F411xE) && !defined(STM32F401xE) && !defined(STM32F401xC)
            #endif //!defined(STM32_NO_SERIAL_2_3)
        }
    }
}

#ifdef SERIAL_DMA
void STM32Serial::waitDmaTxCompletion()
{
    FastInterruptDisableLock dLock;
    // If a previous DMA xfer is in progress, wait
    if(dmaTxInProgress)
    {
        txWaiting=Thread::IRQgetCurrentThread();
        do {
            Thread::IRQwait();
            {
                FastInterruptEnableLock eLock(dLock);
                Thread::yield();
            }
        } while(txWaiting);
    }
}

