OpenRTX/OpenRTX/lib/miosix-kernel/miosix/arch/common/drivers/serial_stm32.cpp
void STM32Serial::writeDma(const char *buffer, size_t size)
{
    markBufferBeforeDmaWrite(buffer,size);
    //Quirk: DMA messes up the TC bit, and causes waitSerialTxFifoEmpty() to
    //return prematurely, causing characters to be missed when rebooting
    //immediatley a write. You can just clear the bit manually, but doing that
    //is dangerous, as if you clear the bit but for any reason the serial
    //write doesn't start (think an invalid buffer, or another thread crashing),
    //then TC will never be set and waitSerialTxFifoEmpty() deadlocks!
    //The only way to clear it safely is to first read SR and then write to
    //DR (thus the bit is cleared at the same time a transmission is started,
    //and the race condition is eliminated). This is the purpose of this
    //instruction, it reads SR. When we start the DMA, the DMA controller
    //writes to DR and completes the TC clear sequence.
    #if !defined(_ARCH_CORTEXM7_STM32F7) && !defined(_ARCH_CORTEXM7_STM32H7) \
     && !defined(_ARCH_CORTEXM0_STM32)   && !defined(_ARCH_CORTEXM4_STM32F3) \
     && !defined(_ARCH_CORTEXM4_STM32L4)
    while((port->SR & USART_SR_TXE)==0) ;
    #else //_ARCH_CORTEXM7_STM32F7/H7
    while((port->ISR & USART_ISR_TXE)==0) ;
    #endif //_ARCH_CORTEXM7_STM32F7/H7
    
    dmaTxInProgress=true;
    #if defined(_ARCH_CORTEXM3_STM32)
    dmaTx->CPAR=reinterpret_cast<unsigned int>(&port->DR);
    dmaTx->CMAR=reinterpret_cast<unsigned int>(buffer);
    dmaTx->CNDTR=size;
    dmaTx->CCR=DMA_CCR4_MINC  //Increment RAM pointer
             | DMA_CCR4_DIR   //Memory to peripheral
             | DMA_CCR4_TEIE  //Interrupt on transfer error
             | DMA_CCR4_TCIE  //Interrupt on transfer complete
             | DMA_CCR4_EN;   //Start DMA
    #else
    #if defined(_ARCH_CORTEXM4_STM32F3) || defined(_ARCH_CORTEXM4_STM32L4)
    dmaTx->CPAR=reinterpret_cast<unsigned int>(&port->TDR);
    dmaTx->CMAR=reinterpret_cast<unsigned int>(buffer);
    dmaTx->CNDTR=size;
    dmaTx->CCR=DMA_CCR_MINC  //Increment RAM pointer
             | DMA_CCR_DIR   //Memory to peripheral
             | DMA_CCR_TEIE  //Interrupt on transfer error
             | DMA_CCR_TCIE  //Interrupt on transfer complete
             | DMA_CCR_EN;   //Start DMA
    #else  //_ARCH_CORTEXM4_STM32F3
    #if !defined(_ARCH_CORTEXM7_STM32F7) && !defined(_ARCH_CORTEXM7_STM32H7) \
     && !defined(_ARCH_CORTEXM0_STM32)
    dmaTx->PAR=reinterpret_cast<unsigned int>(&port->DR);
    #else //_ARCH_CORTEXM7_STM32F7/H7
    dmaTx->PAR=reinterpret_cast<unsigned int>(&port->TDR);
    #endif //_ARCH_CORTEXM7_STM32F7/H7
    dmaTx->M0AR=reinterpret_cast<unsigned int>(buffer);
    dmaTx->NDTR=size;
    //Quirk: not enabling DMA_SxFCR_FEIE because the USART seems to
    //generate a spurious fifo error. The code was tested and the
    //transfer completes successfully even in the presence of this fifo
    //error
    dmaTx->FCR=DMA_SxFCR_DMDIS;//Enable fifo
    dmaTx->CR=DMA_SxCR_CHSEL_2 //Select channel 4 (USART_TX)
                   | DMA_SxCR_MINC    //Increment RAM pointer
                   | DMA_SxCR_DIR_0   //Memory to peripheral
                   | DMA_SxCR_TCIE    //Interrupt on completion
                   | DMA_SxCR_TEIE    //Interrupt on transfer error
                   | DMA_SxCR_DMEIE   //Interrupt on direct mode error
                   | DMA_SxCR_EN;     //Start the DMA
    #endif //_ARCH_CORTEXM4_STM32F3
    #endif //_ARCH_CORTEXM3_STM32
}

void STM32Serial::IRQreadDma()
{
    int elem=IRQdmaReadStop();
    markBufferAfterDmaRead(rxBuffer,rxQueueMin);
    for(int i=0;i<elem;i++)
        if(rxQueue.tryPut(rxBuffer[i])==false) /*fifo overflow*/;
    IRQdmaReadStart();
}

void STM32Serial::IRQdmaReadStart()
{
    #if defined(_ARCH_CORTEXM3_STM32)
    dmaRx->CPAR=reinterpret_cast<unsigned int>(&port->DR);
    dmaRx->CMAR=reinterpret_cast<unsigned int>(rxBuffer);
    dmaRx->CNDTR=rxQueueMin;
    dmaRx->CCR=DMA_CCR4_MINC  //Increment RAM pointer
             | 0              //Peripheral to memory
             | DMA_CCR4_TEIE  //Interrupt on transfer error
             | DMA_CCR4_TCIE  //Interrupt on transfer complete
             | DMA_CCR4_EN;   //Start DMA
    #else
    #if defined(_ARCH_CORTEXM4_STM32F3) || defined(_ARCH_CORTEXM4_STM32L4)
    dmaRx->CPAR=reinterpret_cast<unsigned int>(&port->RDR);
    dmaRx->CMAR=reinterpret_cast<unsigned int>(rxBuffer);
    dmaRx->CNDTR=rxQueueMin;
    dmaRx->CCR=DMA_CCR_MINC  //Increment RAM pointer
             | 0              //Peripheral to memory
             | DMA_CCR_TEIE  //Interrupt on transfer error
             | DMA_CCR_TCIE  //Interrupt on transfer complete
             | DMA_CCR_EN;   //Start DMA
    #else //_ARCH_CORTEXM4_STM32F3
    #if !defined(_ARCH_CORTEXM7_STM32F7) && !defined(_ARCH_CORTEXM7_STM32H7) \
     && !defined(_ARCH_CORTEXM0_STM32)
    dmaRx->PAR=reinterpret_cast<unsigned int>(&port->DR);
    #else //_ARCH_CORTEXM7_STM32F7/H7
    dmaRx->PAR=reinterpret_cast<unsigned int>(&port->RDR);
    #endif //_ARCH_CORTEXM7_STM32F7/H7
    dmaRx->M0AR=reinterpret_cast<unsigned int>(rxBuffer);
    dmaRx->NDTR=rxQueueMin;
    dmaRx->CR=DMA_SxCR_CHSEL_2 //Select channel 4 (USART_RX)
                   | DMA_SxCR_MINC    //Increment RAM pointer
                   | 0                //Peripheral to memory
                   | DMA_SxCR_HTIE    //Interrupt on half transfer
                   | DMA_SxCR_TEIE    //Interrupt on transfer error
                   | DMA_SxCR_DMEIE   //Interrupt on direct mode error
                   | DMA_SxCR_EN;     //Start the DMA
    #endif //_ARCH_CORTEXM4_STM32F3
    #endif //_ARCH_CORTEXM3_STM32
}

int STM32Serial::IRQdmaReadStop()
{
    #if defined(_ARCH_CORTEXM3_STM32) || defined(_ARCH_CORTEXM4_STM32F3) \
     || defined(_ARCH_CORTEXM4_STM32L4)
    dmaRx->CCR=0;
    static const unsigned int irqMask[]=
    {
        DMA_IFCR_CGIF5,
        DMA_IFCR_CGIF6,
        DMA_IFCR_CGIF3   
    };
    DMA1->IFCR=irqMask[getId()-1];
    return rxQueueMin-dmaRx->CNDTR;
    #else //_ARCH_CORTEXM3_STM32
    //Stop DMA and wait for it to actually stop
    dmaRx->CR &= ~DMA_SxCR_EN;
    while(dmaRx->CR & DMA_SxCR_EN) ;
    static const unsigned int irqMask[]=
    {
        (DMA_HIFCR_CTCIF5 | DMA_HIFCR_CHTIF5 | DMA_HIFCR_CTEIF5 | DMA_HIFCR_CDMEIF5 | DMA_HIFCR_CFEIF5),
        (DMA_HIFCR_CTCIF5 | DMA_HIFCR_CHTIF5 | DMA_HIFCR_CTEIF5 | DMA_HIFCR_CDMEIF5 | DMA_HIFCR_CFEIF5),
        (DMA_LIFCR_CTCIF1 | DMA_LIFCR_CHTIF1 | DMA_LIFCR_CTEIF1 | DMA_LIFCR_CDMEIF1 | DMA_LIFCR_CFEIF1)
    };
    static volatile unsigned long * const irqRegs[]=
    {
        &DMA2->HIFCR,
        &DMA1->HIFCR,
        &DMA1->LIFCR
    };
    *irqRegs[getId()-1]=irqMask[getId()-1];
    return rxQueueMin-dmaRx->NDTR;
    #endif //_ARCH_CORTEXM3_STM32
}
#endif //SERIAL_DMA

} //namespace miosix
